const {expect} = require('chai')


function revert(str) {
  if(typeof str === 'string'){ //якщо тип агрумента 'sting' заходимо в умову 
    const reversedStr = '' //ініціалізуємо нову змінну 
    for(let i = str.length-1; i>-1; i--){ //ітеруємо стрінгу
      reversedStr += str[i] // додаємо до змінної букви з кінця нашої стрінги
    }
    return reversedStr// повертаємо нову стрінгу яка є зворотньою від аргумента
  }
  else {
    return null //якщо аргумент був не стрінга повертаємо null
  }
}
// функія revert приймає в аргумент стрінгу і повертає нову стрінгу 
// задом на перед
//********************************************************** 
// const revert = str => {
//   let reversedStr = ''
//   for(let i = str.length-1; i>-1; i--){
//     reversedStr += str[i]
//   }
//   return reversedStr
// }
//********************************************************** 
//можна записати от так
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//Потрібно написати функцію яка приймає в аргументи число і повертає 
//після її виклику число аргумента помножено на 2 
// додати it() в describe та протестувати написану функцію

describe('Basic mocha test', () => {
  it('assert', () => {
    expect(1).to.eql(1)
  })
  it('reversed', () => {
    //Подивитися на функію, додати перевірку на умову в else якщо аргумент
    // не стрінга
    expect(revert('ab')).to.eql('ba')
  })
})


